[
    {
        "id": "01",
        "name": "C Programming for Beginners",
        "courseBanner": "https://cka.collectiva.in/Content/images/CourseImages/9.png",
        "courseIntro": "C programming is an excellent language to learn to program for beginners.",
        "courseDetails": "This Live course will cover all the concepts of C Programming under the common year/1st year syllabus. This course is specially designed to help you understand the concepts you need help in. This course will help you in solving numerical, answer questions, understand concepts & help you prepare for internal/exams.",
        "about": "C programming is a general-purpose, procedural, imperative computer programming language developed in 1972 by Dennis M. Ritchie at the Bell Telephone Laboratories to develop the UNIX operating system. C is the most widely used computer language. It keeps fluctuating at number one scale of popularity along with Java programming language, which is also equally popular and most widely used among modern software programmers.",
        "language": "English",
        "cost": "25.50",
        "enrolled": "772",
        "instructor": {
            "name": "Farhan Reza",
            "image": "https://i.pinimg.com/736x/a7/66/92/a766923c29305a16ce461b2ae54f4c68.jpg"
        },
        "category": "Programming Language"
    },
    {
        "id": "02",
        "name": "JavaScript for Beginners",
        "courseBanner": "https://image.shutterstock.com/image-vector/javascript-programming-language-script-code-260nw-1062509657.jpg",
        "courseIntro": "Learn javascript online and supercharge your web design with this Javascript for beginners training course.",
        "courseDetails": "Our JavaScript Tutorial is designed for beginners and professionals both. JavaScript is used to create client-side dynamic pages. JavaScript is an object-based scripting language which is lightweight and cross-platform. JavaScript is not a compiled language, but it is a translated language. The JavaScript Translator (embedded in the browser) is responsible for translating the JavaScript code for the web browser.",
        "about": "JavaScript is a dynamic computer programming language. It is lightweight and most commonly used as a part of web pages, whose implementations allow client-side script to interact with the user and make dynamic pages. It is an interpreted programming language with object-oriented capabilities.  JavaScript was first known as LiveScript, but Netscape changed its name to JavaScript, possibly because of the excitement being generated by Java. JavaScript made its first appearance in Netscape 2.0 in 1995 with the name LiveScript. The general-purpose core of the language has been embedded in Netscape, Internet Explorer, and other web browsers.",
        "language": "English",
        "cost": "35.00",
        "enrolled": "485",
        "instructor": {
            "name": "Akash",
            "image": "https://eddie-hernandez.com/wp-content/uploads/2022/03/DG-Legal-Headshot-Example-San-Francisco-01.jpg"
        },
        "category": "Programming Language"
    },
    {
        "id": "03",
        "name": "JAVA programming",
        "courseBanner": "https://www.jrebel.com/sites/default/files/image/2020-05/image-blog-revel-top-java-tools.jpg",
        "courseIntro": "Utilize our Java tutorial to learn the basics of the popular language, including Java objects, in this introductory course.",
        "courseDetails": "Taking this course will provide you with a basic foundation in Java syntax, which is the first step towards becoming a successful Java developer. You’ll learn how computers make decisions and how Java keeps track of information through variables and data types. You’ll learn to create conditional statements, functions, and loops to process information and solve problems. You’ll even learn to use IntelliJ, a Java IDE (Integrated Development Environment) that professional developers use, to build, compile, and debug your code. These are foundational programming skills, and mastering them is a must for all aspiring programmers. This course is the first in our Java Programming course series. After you complete this course, you'll be ready to take Object Oriented Programming in Java.",
        "about": "Java is a general-purpose, class-based, object-oriented programming language designed for having lesser implementation dependencies. It is a computing platform for application development. Java is fast, secure, and reliable, therefore. It is widely used for developing Java applications in laptops, data centers, game consoles, scientific supercomputers, cell phones, etc.",
        "language": "English",
        "cost": "45.50",
        "enrolled": "1155",
        "instructor": {
            "name": "Tonmoy",
            "image": "https://image.shutterstock.com/image-photo/profile-side-view-photo-professional-260nw-1171820050.jpg"
        },
        "category": "Programming Language"
    },
    {
        "id": "04",
        "name": "Python for Beginners",
        "courseBanner": "https://e6v4p8w2.rocketcdn.me/wp-content/uploads/2022/01/01-Introduction-to-Python-Programming-Beginners-Guide-Cover-Image-e1641345507776.png",
        "courseIntro": "Python is a popular general-purpose programming language. It is used in machine learning, web development, desktop applications, and many other fields.",
        "courseDetails": "Python is widely considered among the easiest programming languages for beginners to learn. If you’re interested in learning a programming language, Python is a good place to start. It’s also one of the most widely used. The TIOBE Index for June 2021 lists Python as the second most popular language after C, and its popularity is growing. As you learn, you can take advantage of the robust community of fellow learners and developers, as well as the job opportunities that come with knowing Python.",
        "about": "Python is a high-level, interpreted, interactive and object-oriented scripting language. Python is designed to be highly readable. It uses English keywords frequently where as other languages use punctuation, and it has fewer syntactical constructions than other languages.",
        "language": "English",
        "cost": "40.00",
        "enrolled": "385",
        "instructor": {
            "name": "Akash",
            "image": "https://www.robertwalters.com.my/content/dam/robert-walters/global/images/article-images/man-with-pen-at-desk.jpg"
        },
        "category": "Programming Language"
    },
    {
        "id": "05",
        "name": "Learn C++ Programming",
        "courseBanner": "https://www.analyticsinsight.net/wp-content/uploads/2022/03/bh1-1024x725-1.jpg",
        "courseIntro": "C++ is a powerful general-purpose programming language. It can be used to develop operating systems, browsers, games, and so on.",
        "courseDetails": "C++ tutorial provides basic and advanced concepts of C++. Our C++ tutorial is designed for beginners and professionals.C++ is an object-oriented programming language. It is an extension to C programming.Our C++ tutorial includes all topics of C++ such as first example, control statements, objects and classes, inheritance, constructor, destructor, this, static, polymorphism, abstraction, abstract class, interface, namespace, encapsulation, arrays, strings, exception handling, File IO, etc.",
        "about": "C++ (said C plus plus) is an object-oriented computer language created by notable computer scientist Bjorne Stroustrop as part of the evolution of the C family of languages. It was developed as a cross-platform improvement of C to provide developers with a higher degree of control over memory and system resources.Some call C++ “C with classes” because it introduces object-oriented programming principles, including the use of defined classes, to the C programming language framework. Over time, C++ has remained a very useful language not only in computer programming itself, but in teaching new programmers about how object-oriented programming works. However, it does not support only object-oriented, but also procedural and functional.",
        "language": "English",
        "cost": "30.50",
        "enrolled": "757",
        "instructor": {
            "name": "Reza",
            "image": "https://www.taradawnphotography.com/wp-content/uploads/2018/09/Sample.jpg"
        },
        "category": "Programming Language"
    },
    {
        "id": "06",
        "name": "Learn Data Structures and Algorithms",
        "courseBanner": "https://w10.naukri.com/mailers/2022/naukri-learning/what-is/What-is-Data-Structures-and-Algorithms.jpg",
        "courseIntro": "Data Structure and Algorithms Tutorial, Data Structures are the programmatic way of storing data so that data can be used efficiently.",
        "courseDetails": "Data Structures (DS) tutorial provides basic and advanced concepts of Data Structure. Our Data Structure tutorial is designed for beginners and professionals.Data Structure is a way to store and organize data so that it can be used efficiently.Our Data Structure tutorial includes all topics of Data Structure such as Array, Pointer, Structure, Linked List, Stack, Queue, Graph, Searching, Sorting, Programs, etc.",
        "about": "The data structure name indicates itself that organizing the data in memory. There are many ways of organizing the data in the memory as we have already seen one of the data structures, i.e., array in C language. Array is a collection of memory elements in which data is stored sequentially, i.e., one after another. In other words, we can say that array stores the elements in a continuous manner. This organization of data is done with the help of an array of data structures. There are also other ways to organize the data in memory. Let's see the different types of data structures.The data structure is not any programming language like C, C++, java, etc. It is a set of algorithms that we can use in any programming language to structure the data in the memory.To structure the data in memory, 'n' number of algorithms were proposed, and all these algorithms are known as Abstract data types. These abstract data types are the set of rules.",
        "language": "English",
        "cost": "32.99",
        "enrolled": "305",
        "instructor": {
            "name": "Razor",
            "image": "https://blogs.icrc.org/law-and-policy/wp-content/uploads/sites/102/2020/10/Tomas-Minarik-headshot2.jpg"
        },
        "category": "Programming Language"
    },
    {
        "id": "07",
        "name": "Complete HTML5, CSS3 & Bootstrap 4",
        "courseBanner": "https://i.postimg.cc/MKRFQjZB/js.png",
        "courseIntro": "Learn modern web design and code responsive websites from scratch using HTML5,CSS3 & Bootstrap 4. Develop and code a huge project.",
        "courseDetails": "Responsive web design is about creating web pages that look good on all devices. A responsive web design helps automatically adjust for different screens to make it user friendly.This course touches on each important topic through concept explanation, documentation, and implementation. The entire course is designed for beginners with one goal in mind—to build responsive websites using HTML5, CSS3, Bootstrap, ",
        "about": "Bootstrap is a free front-end framework for faster and easier web development.Bootstrap includes HTML and CSS based design templates for typography, forms, buttons, tables, navigation, modals, image carousels and many other, as well as optional JavaScript plugins.Bootstrap also gives you the ability to easily create responsive designs",
        "language": "English",
        "cost": "15.50",
        "enrolled": "355",
        "instructor": {
            "name": "Harun",
            "image": "https://i.pinimg.com/originals/cc/c1/db/ccc1dbf21c6860a9a2a601eefce662ba.jpg"
        },
        "category": "CSS Framework"
    },
    {
        "id": "08",
        "name": "Full Stack Web",
        "courseBanner": "https://cdn.educba.com/academy/wp-content/uploads/2019/11/full-stack-web-developer.png",
        "courseIntro": "Try a full stack web development course on OneSchool and learn the most in-demand website coding skills with the help of real-world experts.",
        "courseDetails": "Full Stack Web Developer course online will enable you to build interactive and responsive web applications using both front-end and back-end technologies. Full Stack Developer course syllabus starts with basics of Web Development, covers JavaScript and jQuery essentials, guides you to build remarkable user interface via Angular or React, helps you to build scalable backend applications using Express & Node.js plus manage data using MongoDB.",
        "about": "Full stack web development refers to the process of developing both client- and server-side software. That means you can expect anyone with 'full stack' included in their job title to have expertise in several front- and backend languages and frameworks. On the frontend, mastery in HTML and CSS is a common requirement for the field. Developers also tend to use JavaScript, jQuery, or Angular when developing a browser platform. Concerning the backend, full stack development consists of programming servers and databases. A server might call for code in PHP, ASP, Python, or Node, while a database can accept languages like SQL, SQLite, or MongoDB.",
        "language": "English",
        "cost": "35.50",
        "enrolled": "355",
        "instructor": {
            "name": "S.F. Reza",
            "image": "https://i.pinimg.com/originals/af/9f/1f/af9f1fed99621ae20f9edd2ab6cbb8bd.jpg"
        },
        "category": "Web Development"
    },
    {
        "id": "09",
        "name": "Android App Development",
        "courseBanner": "https://www.androiddeveloper.co.in/blog/wp-content/uploads/2016/03/Android-App-Development-2.jpg",
        "courseIntro": "Launch Your Android App Development Career. Master the knowledge and skills necessary to develop maintainable mobile computing apps.",
        "courseDetails": "This tutorial has been prepared for the beginners to help them understand basic Android programming. After completing this tutorial you will find yourself at a moderate level of expertise in Android programming from where you can take yourself to next levels.",
        "about": "Android is an open source and Linux-based operating system for mobile devices such as smartphones and tablet computers. Android was developed by the Open Handset Alliance, led by Google, and other companies. This tutorial will teach you basic Android programming and will also take you through some advance concepts related to Android application development.",
        "language": "English",
        "cost": "35.50",
        "enrolled": "355",
        "instructor": {
            "name": "Afran",
            "image": "https://i.pinimg.com/236x/4c/5b/07/4c5b074331656f48e703ce5ad425546e.jpg"
        },
        "category": "Programming Language"
    }
]